#ifndef TOOLS_H_
#define TOOLS_H_
// FIXME docs
// FIXME выбрать один стиль для функций (чекни google code style C++)

//----------------------------------------------------
//! @note Очищает входной поток
//----------------------------------------------------
void clearStdin();

//----------------------------------------------------
//! @param [in] numb число сравниваемое с нулём
//! @return Ф-ия возвращает равно ли число нулю 
//----------------------------------------------------
bool equalZero(double numb);

//----------------------------------------------------
//! @param [in] numb число сравниваемое с NAN
//! @return Ф-ия возвращает является ли число NAN
//----------------------------------------------------
bool myIsNAN(double numb);

//----------------------------------------------------
//! @param [in] numb число проверяемое на равенство бесконечности
//! @return Ф-ия возвращает равно ли число бесконечности 
//----------------------------------------------------
bool myIsInf(double x);

//----------------------------------------------------
//! @param [in] numb число сравниваемое с NAN и бесконечностью
//! @return Ф-ия возвращает является ли число NAN или бесконечностью
//----------------------------------------------------
bool myIsFinite(double numb);


#endif // TOOLS_H_